#Задание 1
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))

print(f"Первое число: {num1}")
print(f"Второе число: {num2}")
