#Задание 1
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))

print("Выберите операцию:")
print("+. Сложение")
print("-. Вычитание")
print("*. Умножение")
print(":. Деление")

choice = input("Введите операцию (+/-/*/:): ")
